work/app/views/users/_person_edit.html.erb

      <div class="social">
        <% @user.identities.each do|provider| %>
---
SELECT "identities".* FROM "identities" WHERE "identities"."user_id" = ?