work/app/controllers/users_controller.rb

  def update
    # authorize! :update, @user
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "category" = ?, "updated_at" = ? WHERE "users"."id" = ?

  def finish_signup
    # authorize! :update, @user
    if request.patch? && params[:user] #&& params[:user][:email]
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "coolplum1213@gmail.com"], ["updated_at", 2016-10-10 17:52:14 UTC], ["id", 1]]

  def destroy
    # authorize! :delete, @user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?