app/views/users/_org_edit.html.erb

      <div class="social">
        <% @user.identities.each do|provider| %>
---
SELECT "identities".* FROM "identities" WHERE "identities"."user_id" = ?

  <div class="post">
    <h3>Posts(<%= @user.microposts.count %>)</h3>
    <% if @user.microposts.any? %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?