app/views/users/show.erb

      <div class="social">
        <% @user.identities.each do|provider| %>
---
SELECT "identities".* FROM "identities" WHERE "identities"."user_id" = ?  [["user_id", 1]]