app/controllers/identities_controller.rb

  def create
    @identity = current_user.identities.build(identity_params)
    if @identity.save
---
INSERT INTO "identities" ("user_id", "provider", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @identity = Identity.find(params[:id])
---
SELECT  "identities".* FROM "identities" WHERE "identities"."id" = ? LIMIT ?